app/Controllers/AuthController.php

SELECT *
FROM `users`
WHERE `username` = 'Nelson'
OR `email` = 'Nelson'
 LIMIT 1
---
    public function login()
    {
        // Check if the form is submitted
        if ($this->request->getMethod() === 'POST') {
            // Validate the form inputs
            $validation = \Config\Services::validation();
            $validation->setRules([
                'username' => 'required',
                'password' => 'required'
            ]);

            if (!$validation->withRequest($this->request)->run()) {
                // If validation fails, return to the login page with errors
                return view('auth/login', ['validation' => $this->validator]);
            }

            // Retrieve form data
            $username = $this->request->getPost('username');
            $password = $this->request->getPost('password');

            // Load the UserModel
            $userModel = new UserModel();

            // Find the user by username or email
            $user = $userModel->where('username', $username)
                              ->orWhere('email', $username)
                              ->first();