app/Controllers/Careers.php

SELECT *
FROM `education_levels`
SELECT *
FROM `users`
---
public function edu_lvls()
{
    $data['title'] = 'Education Levels'; // Set the title

    // Fetch education levels
    $data['education_levels'] = $this->educationLevelsModel->findAll();

    // Fetch users data
    $usersModel = new \App\Models\UserModel();
    $data['users'] = $usersModel->findAll();

INSERT INTO `education_levels` (`name`, `created_by`, `updated_by`, `created_at`, `updated_at`) VALUES ('High School', '4', '4', '2024-08-25 09:04:20', '2024-08-25 09:04:20')
---
        ];


        $this->educationLevelsModel->insert($data);

SELECT *
FROM `education_levels`
WHERE `education_levels`.`id` = '3'
---
public function edit_edu_lvls($id)
{

    $educationLevel = $this->educationLevelsModel->find($id);

UPDATE `education_levels` SET `name` = 'Post Diploma', `updated_by` = '4', `updated_at` = '2024-08-25 08:59:47'
WHERE `education_levels`.`id` IN ('3')
---
        ];


        $this->educationLevelsModel->update($id, $data);