app/Controllers/ProcurementPlans.php

SELECT *
FROM `procurement_plans`
SELECT *
FROM `users`
---
    public function proc_plans()
    {
        $model = new ProcurementPlanModel();
        $userModel = new UserModel();

        $data = [
            'title' => 'Procurement Plans',
            'procurementPlans' => $model->findAll(),
            'users' => $userModel->findAll()

SELECT *
FROM `procurement_plans`
WHERE `procurement_plans`.`id` = '1'
---
    public function proc_plans_edit($id)
    {
        $model = new ProcurementPlanModel();
        $data['procurement_plan'] = $model->find($id);