app/Controllers/Tenders.php

SELECT *
FROM `tenders`
SELECT *
FROM `users`
---
    public function tenders()
    {
        $data['title'] = 'Tenders';
        $data['tenders'] = $this->tendersModel->findAll();

        $usersModel = new UserModel();
        $data['users'] = $usersModel->findAll();

SELECT *
FROM `doc_types`
SELECT *
FROM `eligibility`
---
    }

    $data['title'] = 'Create Tender';
    $data['doc_types'] = $this->docTypesModel->findAll();
    $data['eligibilities'] = $this->eligibilityModel->findAll();