app/Controllers/VacancyFunctions.php

SELECT *
FROM `vac_function`
SELECT *
FROM `users`
---
    public function job_functions()
    {
        $data['title'] = 'Vacancy Functions';


        $data['vacancy_functions'] = $this->vacancyFunctionModel->findAll();


        $usersModel = new UserModel();
        $data['users'] = $usersModel->findAll();